docs/campaigns/F14-cooling-ladder/K2b_runs/K2bU3_D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantBoussinesqPimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         80.0;
deltaT          0.005;
writeControl    adjustableRunTime;
writeInterval   20.0;
purgeWrite      0;
writeFormat     ascii;
writePrecision  10;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable false;
adjustTimeStep  yes;
maxCo           2.0;
maxDeltaT       0.25;

functions
{
    T_rack0_in_mdot
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            rack0_in;
        operation       weightedAverage;
        fields          (T);
        weightField     phi;
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  runTime;
        executeInterval 0.2;
        writeControl    runTime;
        writeInterval   0.2;
    }
    T_rack1_in_mdot
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            rack1_in;
        operation       weightedAverage;
        fields          (T);
        weightField     phi;
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  runTime;
        executeInterval 0.2;
        writeControl    runTime;
        writeInterval   0.2;
    }
    T_rack2_in_mdot
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            rack2_in;
        operation       weightedAverage;
        fields          (T);
        weightField     phi;
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  runTime;
        executeInterval 0.2;
        writeControl    runTime;
        writeInterval   0.2;
    }
    T_rack3_in_mdot
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            rack3_in;
        operation       weightedAverage;
        fields          (T);
        weightField     phi;
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  runTime;
        executeInterval 0.2;
        writeControl    runTime;
        writeInterval   0.2;
    }
    phi_return
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            return;
        operation       sum;
        fields          (phi);
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  runTime;
        executeInterval 0.2;
        writeControl    runTime;
        writeInterval   0.2;
    }
    Tspan
    {
        type            fieldMinMax;
        libs            (fieldFunctionObjects);
        fields          (T U);
        location        true;
        writeToFile     true;
        log             true;
        executeControl  runTime;
        executeInterval 0.2;
        writeControl    runTime;
        writeInterval   0.2;
    }
}

// ************************************************************************* //
