docs/campaigns/F14-cooling-ladder/K2b_runs/K2bU3_D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.000000 0.000000 0.000000)
    (0.600000 0.000000 0.000000)
    (1.200000 0.000000 0.000000)
    (1.800000 0.000000 0.000000)
    (2.400000 0.000000 0.000000)
    (3.000000 0.000000 0.000000)
    (3.600000 0.000000 0.000000)
    (0.000000 0.600000 0.000000)
    (0.600000 0.600000 0.000000)
    (1.200000 0.600000 0.000000)
    (1.800000 0.600000 0.000000)
    (2.400000 0.600000 0.000000)
    (3.000000 0.600000 0.000000)
    (3.600000 0.600000 0.000000)
    (0.000000 1.200000 0.000000)
    (0.600000 1.200000 0.000000)
    (1.200000 1.200000 0.000000)
    (1.800000 1.200000 0.000000)
    (2.400000 1.200000 0.000000)
    (3.000000 1.200000 0.000000)
    (3.600000 1.200000 0.000000)
    (0.000000 2.300000 0.000000)
    (0.600000 2.300000 0.000000)
    (1.200000 2.300000 0.000000)
    (1.800000 2.300000 0.000000)
    (2.400000 2.300000 0.000000)
    (3.000000 2.300000 0.000000)
    (3.600000 2.300000 0.000000)
    (0.000000 2.600000 0.000000)
    (0.600000 2.600000 0.000000)
    (1.200000 2.600000 0.000000)
    (1.800000 2.600000 0.000000)
    (2.400000 2.600000 0.000000)
    (3.000000 2.600000 0.000000)
    (3.600000 2.600000 0.000000)
    (0.000000 3.200000 0.000000)
    (0.600000 3.200000 0.000000)
    (1.200000 3.200000 0.000000)
    (1.800000 3.200000 0.000000)
    (2.400000 3.200000 0.000000)
    (3.000000 3.200000 0.000000)
    (3.600000 3.200000 0.000000)
    (0.000000 3.500000 0.000000)
    (0.600000 3.500000 0.000000)
    (1.200000 3.500000 0.000000)
    (1.800000 3.500000 0.000000)
    (2.400000 3.500000 0.000000)
    (3.000000 3.500000 0.000000)
    (3.600000 3.500000 0.000000)
    (0.000000 0.000000 2.000000)
    (0.600000 0.000000 2.000000)
    (1.200000 0.000000 2.000000)
    (1.800000 0.000000 2.000000)
    (2.400000 0.000000 2.000000)
    (3.000000 0.000000 2.000000)
    (3.600000 0.000000 2.000000)
    (0.000000 0.600000 2.000000)
    (0.600000 0.600000 2.000000)
    (1.200000 0.600000 2.000000)
    (1.800000 0.600000 2.000000)
    (2.400000 0.600000 2.000000)
    (3.000000 0.600000 2.000000)
    (3.600000 0.600000 2.000000)
    (0.000000 1.200000 2.000000)
    (0.600000 1.200000 2.000000)
    (1.200000 1.200000 2.000000)
    (1.800000 1.200000 2.000000)
    (2.400000 1.200000 2.000000)
    (3.000000 1.200000 2.000000)
    (3.600000 1.200000 2.000000)
    (0.000000 2.300000 2.000000)
    (0.600000 2.300000 2.000000)
    (1.200000 2.300000 2.000000)
    (1.800000 2.300000 2.000000)
    (2.400000 2.300000 2.000000)
    (3.000000 2.300000 2.000000)
    (3.600000 2.300000 2.000000)
    (0.000000 2.600000 2.000000)
    (0.600000 2.600000 2.000000)
    (1.200000 2.600000 2.000000)
    (1.800000 2.600000 2.000000)
    (2.400000 2.600000 2.000000)
    (3.000000 2.600000 2.000000)
    (3.600000 2.600000 2.000000)
    (0.000000 3.200000 2.000000)
    (0.600000 3.200000 2.000000)
    (1.200000 3.200000 2.000000)
    (1.800000 3.200000 2.000000)
    (2.400000 3.200000 2.000000)
    (3.000000 3.200000 2.000000)
    (3.600000 3.200000 2.000000)
    (0.000000 3.500000 2.000000)
    (0.600000 3.500000 2.000000)
    (1.200000 3.500000 2.000000)
    (1.800000 3.500000 2.000000)
    (2.400000 3.500000 2.000000)
    (3.000000 3.500000 2.000000)
    (3.600000 3.500000 2.000000)
    (0.000000 0.000000 2.700000)
    (0.600000 0.000000 2.700000)
    (1.200000 0.000000 2.700000)
    (1.800000 0.000000 2.700000)
    (2.400000 0.000000 2.700000)
    (3.000000 0.000000 2.700000)
    (3.600000 0.000000 2.700000)
    (0.000000 0.600000 2.700000)
    (0.600000 0.600000 2.700000)
    (1.200000 0.600000 2.700000)
    (1.800000 0.600000 2.700000)
    (2.400000 0.600000 2.700000)
    (3.000000 0.600000 2.700000)
    (3.600000 0.600000 2.700000)
    (0.000000 1.200000 2.700000)
    (0.600000 1.200000 2.700000)
    (1.200000 1.200000 2.700000)
    (1.800000 1.200000 2.700000)
    (2.400000 1.200000 2.700000)
    (3.000000 1.200000 2.700000)
    (3.600000 1.200000 2.700000)
    (0.000000 2.300000 2.700000)
    (0.600000 2.300000 2.700000)
    (1.200000 2.300000 2.700000)
    (1.800000 2.300000 2.700000)
    (2.400000 2.300000 2.700000)
    (3.000000 2.300000 2.700000)
    (3.600000 2.300000 2.700000)
    (0.000000 2.600000 2.700000)
    (0.600000 2.600000 2.700000)
    (1.200000 2.600000 2.700000)
    (1.800000 2.600000 2.700000)
    (2.400000 2.600000 2.700000)
    (3.000000 2.600000 2.700000)
    (3.600000 2.600000 2.700000)
    (0.000000 3.200000 2.700000)
    (0.600000 3.200000 2.700000)
    (1.200000 3.200000 2.700000)
    (1.800000 3.200000 2.700000)
    (2.400000 3.200000 2.700000)
    (3.000000 3.200000 2.700000)
    (3.600000 3.200000 2.700000)
    (0.000000 3.500000 2.700000)
    (0.600000 3.500000 2.700000)
    (1.200000 3.500000 2.700000)
    (1.800000 3.500000 2.700000)
    (2.400000 3.500000 2.700000)
    (3.000000 3.500000 2.700000)
    (3.600000 3.500000 2.700000)
);

blocks
(
    hex (0 1 8 7 49 50 57 56) (6 6 20) simpleGrading (1 1 1)
    hex (1 2 9 8 50 51 58 57) (6 6 20) simpleGrading (1 1 1)
    hex (2 3 10 9 51 52 59 58) (6 6 20) simpleGrading (1 1 1)
    hex (3 4 11 10 52 53 60 59) (6 6 20) simpleGrading (1 1 1)
    hex (4 5 12 11 53 54 61 60) (6 6 20) simpleGrading (1 1 1)
    hex (5 6 13 12 54 55 62 61) (6 6 20) simpleGrading (1 1 1)
    hex (7 8 15 14 56 57 64 63) (6 6 20) simpleGrading (1 1 1)
    hex (8 9 16 15 57 58 65 64) (6 6 20) simpleGrading (1 1 1)
    hex (9 10 17 16 58 59 66 65) (6 6 20) simpleGrading (1 1 1)
    hex (10 11 18 17 59 60 67 66) (6 6 20) simpleGrading (1 1 1)
    hex (11 12 19 18 60 61 68 67) (6 6 20) simpleGrading (1 1 1)
    hex (12 13 20 19 61 62 69 68) (6 6 20) simpleGrading (1 1 1)
    hex (14 15 22 21 63 64 71 70) (6 11 20) simpleGrading (1 1 1)
    hex (19 20 27 26 68 69 76 75) (6 11 20) simpleGrading (1 1 1)
    hex (21 22 29 28 70 71 78 77) (6 3 20) simpleGrading (1 1 1)
    hex (22 23 30 29 71 72 79 78) (6 3 20) simpleGrading (1 1 1)
    hex (23 24 31 30 72 73 80 79) (6 3 20) simpleGrading (1 1 1)
    hex (24 25 32 31 73 74 81 80) (6 3 20) simpleGrading (1 1 1)
    hex (25 26 33 32 74 75 82 81) (6 3 20) simpleGrading (1 1 1)
    hex (26 27 34 33 75 76 83 82) (6 3 20) simpleGrading (1 1 1)
    hex (28 29 36 35 77 78 85 84) (6 6 20) simpleGrading (1 1 1)
    hex (29 30 37 36 78 79 86 85) (6 6 20) simpleGrading (1 1 1)
    hex (30 31 38 37 79 80 87 86) (6 6 20) simpleGrading (1 1 1)
    hex (31 32 39 38 80 81 88 87) (6 6 20) simpleGrading (1 1 1)
    hex (32 33 40 39 81 82 89 88) (6 6 20) simpleGrading (1 1 1)
    hex (33 34 41 40 82 83 90 89) (6 6 20) simpleGrading (1 1 1)
    hex (35 36 43 42 84 85 92 91) (6 3 20) simpleGrading (1 1 1)
    hex (36 37 44 43 85 86 93 92) (6 3 20) simpleGrading (1 1 1)
    hex (37 38 45 44 86 87 94 93) (6 3 20) simpleGrading (1 1 1)
    hex (38 39 46 45 87 88 95 94) (6 3 20) simpleGrading (1 1 1)
    hex (39 40 47 46 88 89 96 95) (6 3 20) simpleGrading (1 1 1)
    hex (40 41 48 47 89 90 97 96) (6 3 20) simpleGrading (1 1 1)
    hex (49 50 57 56 98 99 106 105) (6 6 7) simpleGrading (1 1 1)
    hex (50 51 58 57 99 100 107 106) (6 6 7) simpleGrading (1 1 1)
    hex (51 52 59 58 100 101 108 107) (6 6 7) simpleGrading (1 1 1)
    hex (52 53 60 59 101 102 109 108) (6 6 7) simpleGrading (1 1 1)
    hex (53 54 61 60 102 103 110 109) (6 6 7) simpleGrading (1 1 1)
    hex (54 55 62 61 103 104 111 110) (6 6 7) simpleGrading (1 1 1)
    hex (56 57 64 63 105 106 113 112) (6 6 7) simpleGrading (1 1 1)
    hex (57 58 65 64 106 107 114 113) (6 6 7) simpleGrading (1 1 1)
    hex (58 59 66 65 107 108 115 114) (6 6 7) simpleGrading (1 1 1)
    hex (59 60 67 66 108 109 116 115) (6 6 7) simpleGrading (1 1 1)
    hex (60 61 68 67 109 110 117 116) (6 6 7) simpleGrading (1 1 1)
    hex (61 62 69 68 110 111 118 117) (6 6 7) simpleGrading (1 1 1)
    hex (63 64 71 70 112 113 120 119) (6 11 7) simpleGrading (1 1 1)
    hex (64 65 72 71 113 114 121 120) (6 11 7) simpleGrading (1 1 1)
    hex (65 66 73 72 114 115 122 121) (6 11 7) simpleGrading (1 1 1)
    hex (66 67 74 73 115 116 123 122) (6 11 7) simpleGrading (1 1 1)
    hex (67 68 75 74 116 117 124 123) (6 11 7) simpleGrading (1 1 1)
    hex (68 69 76 75 117 118 125 124) (6 11 7) simpleGrading (1 1 1)
    hex (70 71 78 77 119 120 127 126) (6 3 7) simpleGrading (1 1 1)
    hex (71 72 79 78 120 121 128 127) (6 3 7) simpleGrading (1 1 1)
    hex (72 73 80 79 121 122 129 128) (6 3 7) simpleGrading (1 1 1)
    hex (73 74 81 80 122 123 130 129) (6 3 7) simpleGrading (1 1 1)
    hex (74 75 82 81 123 124 131 130) (6 3 7) simpleGrading (1 1 1)
    hex (75 76 83 82 124 125 132 131) (6 3 7) simpleGrading (1 1 1)
    hex (77 78 85 84 126 127 134 133) (6 6 7) simpleGrading (1 1 1)
    hex (78 79 86 85 127 128 135 134) (6 6 7) simpleGrading (1 1 1)
    hex (79 80 87 86 128 129 136 135) (6 6 7) simpleGrading (1 1 1)
    hex (80 81 88 87 129 130 137 136) (6 6 7) simpleGrading (1 1 1)
    hex (81 82 89 88 130 131 138 137) (6 6 7) simpleGrading (1 1 1)
    hex (82 83 90 89 131 132 139 138) (6 6 7) simpleGrading (1 1 1)
    hex (84 85 92 91 133 134 141 140) (6 3 7) simpleGrading (1 1 1)
    hex (85 86 93 92 134 135 142 141) (6 3 7) simpleGrading (1 1 1)
    hex (86 87 94 93 135 136 143 142) (6 3 7) simpleGrading (1 1 1)
    hex (87 88 95 94 136 137 144 143) (6 3 7) simpleGrading (1 1 1)
    hex (88 89 96 95 137 138 145 144) (6 3 7) simpleGrading (1 1 1)
    hex (89 90 97 96 138 139 146 145) (6 3 7) simpleGrading (1 1 1)
);

edges();

boundary
(
    floor
    {
        type wall;
        faces
        (
            (0 7 8 1)
            (1 8 9 2)
            (2 9 10 3)
            (3 10 11 4)
            (4 11 12 5)
            (5 12 13 6)
            (7 14 15 8)
            (12 19 20 13)
            (14 21 22 15)
            (19 26 27 20)
            (21 28 29 22)
            (22 29 30 23)
            (23 30 31 24)
            (24 31 32 25)
            (25 32 33 26)
            (26 33 34 27)
            (28 35 36 29)
            (29 36 37 30)
            (30 37 38 31)
            (31 38 39 32)
            (32 39 40 33)
            (33 40 41 34)
            (35 42 43 36)
            (36 43 44 37)
            (37 44 45 38)
            (38 45 46 39)
            (39 46 47 40)
            (40 47 48 41)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (98 99 106 105)
            (99 100 107 106)
            (100 101 108 107)
            (101 102 109 108)
            (102 103 110 109)
            (103 104 111 110)
            (105 106 113 112)
            (106 107 114 113)
            (107 108 115 114)
            (108 109 116 115)
            (109 110 117 116)
            (110 111 118 117)
            (112 113 120 119)
            (113 114 121 120)
            (114 115 122 121)
            (115 116 123 122)
            (116 117 124 123)
            (117 118 125 124)
            (119 120 127 126)
            (120 121 128 127)
            (121 122 129 128)
            (122 123 130 129)
            (123 124 131 130)
            (124 125 132 131)
            (126 127 134 133)
            (131 132 139 138)
            (133 134 141 140)
            (134 135 142 141)
            (135 136 143 142)
            (136 137 144 143)
            (137 138 145 144)
            (138 139 146 145)
        );
    }
    wall_cold
    {
        type wall;
        faces
        (
            (0 1 50 49)
            (1 2 51 50)
            (2 3 52 51)
            (3 4 53 52)
            (4 5 54 53)
            (5 6 55 54)
            (49 50 99 98)
            (50 51 100 99)
            (51 52 101 100)
            (52 53 102 101)
            (53 54 103 102)
            (54 55 104 103)
        );
    }
    wall_hot
    {
        type wall;
        faces
        (
            (42 91 92 43)
            (43 92 93 44)
            (44 93 94 45)
            (45 94 95 46)
            (46 95 96 47)
            (47 96 97 48)
            (91 140 141 92)
            (92 141 142 93)
            (93 142 143 94)
            (94 143 144 95)
            (95 144 145 96)
            (96 145 146 97)
        );
    }
    wall_x0
    {
        type wall;
        faces
        (
            (0 49 56 7)
            (7 56 63 14)
            (14 63 70 21)
            (21 70 77 28)
            (28 77 84 35)
            (35 84 91 42)
            (49 98 105 56)
            (56 105 112 63)
            (63 112 119 70)
            (70 119 126 77)
            (77 126 133 84)
            (84 133 140 91)
        );
    }
    wall_x1
    {
        type wall;
        faces
        (
            (6 13 62 55)
            (13 20 69 62)
            (20 27 76 69)
            (27 34 83 76)
            (34 41 90 83)
            (41 48 97 90)
            (55 62 111 104)
            (62 69 118 111)
            (69 76 125 118)
            (76 83 132 125)
            (83 90 139 132)
            (90 97 146 139)
        );
    }
    rack_top
    {
        type wall;
        faces
        (
            (64 71 72 65)
            (65 72 73 66)
            (66 73 74 67)
            (67 74 75 68)
        );
    }
    rack_end
    {
        type wall;
        faces
        (
            (15 22 71 64)
            (19 68 75 26)
        );
    }
    tile
    {
        type patch;
        faces
        (
            (8 15 16 9)
            (9 16 17 10)
            (10 17 18 11)
            (11 18 19 12)
        );
    }
    return
    {
        type patch;
        faces
        (
            (127 128 135 134)
            (128 129 136 135)
            (129 130 137 136)
            (130 131 138 137)
        );
    }
    rack0_in
    {
        type patch;
        faces
        (
            (15 64 65 16)
        );
    }
    rack1_in
    {
        type patch;
        faces
        (
            (16 65 66 17)
        );
    }
    rack2_in
    {
        type patch;
        faces
        (
            (17 66 67 18)
        );
    }
    rack3_in
    {
        type patch;
        faces
        (
            (18 67 68 19)
        );
    }
    rack0_out
    {
        type patch;
        faces
        (
            (22 23 72 71)
        );
    }
    rack1_out
    {
        type patch;
        faces
        (
            (23 24 73 72)
        );
    }
    rack2_out
    {
        type patch;
        faces
        (
            (24 25 74 73)
        );
    }
    rack3_out
    {
        type patch;
        faces
        (
            (25 26 75 74)
        );
    }
);

// ************************************************************************* //
