docs/campaigns/F14-cooling-ladder/K2b_runs/K2bU3_D/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.orig";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 289.0;

boundaryField
{
    floor
    {
        type            zeroGradient;
    }
    ceiling
    {
        type            zeroGradient;
    }
    wall_cold
    {
        type            zeroGradient;
    }
    wall_hot
    {
        type            zeroGradient;
    }
    wall_x0
    {
        type            zeroGradient;
    }
    wall_x1
    {
        type            zeroGradient;
    }
    rack_top
    {
        type            zeroGradient;
    }
    rack_end
    {
        type            zeroGradient;
    }
    tile
    {
        type            fixedValue;
        value           uniform 289.0;
    }
    return
    {
        type            inletOutlet;
        inletValue      uniform 289.0;
        value           uniform 289.0;
    }
    rack0_in
    {
        type            zeroGradient;
    }
    rack1_in
    {
        type            zeroGradient;
    }
    rack2_in
    {
        type            zeroGradient;
    }
    rack3_in
    {
        type            zeroGradient;
    }
    rack0_out
    {
        type            outletMappedUniformInlet;
        outlets
        {
            rack0_in
            {
                fraction    constant 1;
                offset      constant 12.0;
            }
        }
        value           uniform 301.0;
    }
    rack1_out
    {
        type            outletMappedUniformInlet;
        outlets
        {
            rack1_in
            {
                fraction    constant 1;
                offset      constant 12.0;
            }
        }
        value           uniform 301.0;
    }
    rack2_out
    {
        type            outletMappedUniformInlet;
        outlets
        {
            rack2_in
            {
                fraction    constant 1;
                offset      constant 12.0;
            }
        }
        value           uniform 301.0;
    }
    rack3_out
    {
        type            outletMappedUniformInlet;
        outlets
        {
            rack3_in
            {
                fraction    constant 1;
                offset      constant 12.0;
            }
        }
        value           uniform 301.0;
    }
}

// ************************************************************************* //
